insert into Food_Groups (name, description) values ('Λαχανικά', 'Όλα τα ωμά λαχανικά, (π.χ. μαρούλι, λάχανο, καρότο, ντομάτα, αγγούρι, κρεμμύδι κ.ά.)
Όλα τα μαγειρεμένα λαχανικά (π.χ. μπρόκολο, κουνουπίδι, κολοκυθάκια, χόρτα, παντζάρια κ.ά.)
Τα αμυλώδη λαχανικά (π.χ. αρακάς, καλαμπόκι, κολοκύθα)
ΔΕΝ περιλαμβάνεται η πατάτα και οι ποικιλίες της');

insert into Food_Groups (name, description) values ('Φρούτα', 'Όλα τα ωμά φρούτα (π.χ. πορτοκάλι, μήλο, αχλάδι, μπανάνα, ροδάκινο κ.ά.)
Όλα τα αποξηραμένα φρούτα (π.χ. δαμάσκηνα, σταφίδες, βερίκοκα κ.ά.)
Οι φυσικοί χυμοί φρούτων (100% χωρίς προσθήκη ζάχαρης)');

insert into Food_Groups (name, description) values ('Δημητριακά (ψωμί, ρύζι, ζυμαρικά) και Πατάτες', 'Τα δημητριακά:
Σιτάρι, βρόμη, κριθάρι, σίκαλη κ.ά.
Ρύζι

Τα προϊόντα δημητριακών:
Αλεύρι
Ψωμί
Απλά αρτοσκευάσματα π.χ. φρυγανιές, παξιμάδια, κριτσίνια, κράκερ
Σύνθετα αρτοσκευάσματα π.χ. ζύμες, πίτες
Ζυμαρικά π.χ. μακαρόνια, κριθαράκι, χυλοπίτες
Διάφορα προϊόντα δημητριακών π.χ. πλιγούρι,τραχανάς
Δημητριακά πρωινού
Η πατάτα και οι ποικιλίες της');

insert into Food_Groups (name, description) values ('Γάλα και γαλακτοκομικά προϊόντα', 'Το γάλα
Τα γαλακτοκομικά προϊόντα (π.χ. γιαούρτι, τυρί, ξινόγαλο κ.ά.)
ΔΕΝ περιλαμβάνεται το βούτυρο (συγκαταλέγεται στα λίπη και έλαια)');

insert into Food_Groups (name, description) values ('Όσπρια', 'Οι φακές
Τα φασόλια
Τα ρεβίθια
Η φάβα
Τα ξερά κουκιά
Οι ποικιλίες όλων των παραπάνω');

insert into Food_Groups (name, description) values ('Κόκκινο κρέας', 'Μοσχάρι, βοδινό
Χοιρινό
Αρνί, πρόβατο
Κατσίκι, γίδα
Κυνήγι: π.χ. αγριογούρουνο, ελάφι, ζαρκάδι
Όλα τα επεξεργασμένα προϊόντα των παραπάνω');

insert into Food_Groups (name, description) values ('Λευκό κρέας', 'Κοτόπουλο
Γαλοπούλα
Πάπια
Κουνέλι
Κυνήγι: π.χ. φασιανός, ορτύκι, πέρδικα
Όλα τα επεξεργασμένα προϊόντα των παραπάνω');

insert into Food_Groups (name, description) values ('Αυγά', '');

insert into Food_Groups (name, description) values ('Ψάρια και θαλασσινά', '
Τα ψάρια (π.χ. σαρδέλα, μαρίδα, γόπα, γαύρος, αθερίνα, ροφός, συναγρίδα, σφυρίδα, μπακαλιάρος, γαλέος, τόνος, λαβράκι, σαργός, τσιπούρα, λυθρίνι)
Τα θαλασσινά (μαλάκια, οστρακοειδή, οστρακόδερμα) π.χ. καλαμάρι, σουπιά, χταπόδι, γαρίδα, μύδια, στρείδια.');

insert into Food_Groups (name, description) values ('Προστιθέμενα λίπη και έλαια, ελιές και ξηροί καρποί', '
Τα προστιθέμενα λίπη και έλαια:
Ελαιόλαδο
Άλλα έλαια φυτικής προέλευσης (σπορέλαια): ηλιέλαιο, καλαμποκέλαιο, σογιέλαιο, σησαμέλαιο κ.ά.
Μαργαρίνη
Βούτυρο
Οι ελιές
Οι ξηροί καρποί
Καρύδια, αμύγδαλα, φιστίκια, φουντούκια κ.ά.
Ηλιόσποροι, σουσάμι κ.ά.
Προϊόντα επάλειψης που προέρχονται από τα παραπάνω (π.χ., ταχίνι)');
