insert into Food_Groups (name, description) 
values ('Λαχανικά', 'Όλα τα ωμά λαχανικά, (π.χ. μαρούλι, λάχανο, καρότο, ντομάτα, αγγούρι, κρεμμύδι κ.ά.)
Όλα τα μαγειρεμένα λαχανικά (π.χ. μπρόκολο, κουνουπίδι, κολοκυθάκια, χόρτα, παντζάρια κ.ά.)
Τα αμυλώδη λαχανικά (π.χ. αρακάς, καλαμπόκι, κολοκύθα)
ΔΕΝ περιλαμβάνεται η πατάτα και οι ποικιλίες της'),

('Φρούτα', 'Όλα τα ωμά φρούτα (π.χ. πορτοκάλι, μήλο, αχλάδι, μπανάνα, ροδάκινο κ.ά.)
Όλα τα αποξηραμένα φρούτα (π.χ. δαμάσκηνα, σταφίδες, βερίκοκα κ.ά.)
Οι φυσικοί χυμοί φρούτων (100% χωρίς προσθήκη ζάχαρης)'),

('Δημητριακά (ψωμί, ρύζι, ζυμαρικά) και Πατάτες', 'Τα δημητριακά:
Σιτάρι, βρόμη, κριθάρι, σίκαλη κ.ά.
Ρύζι

Τα προϊόντα δημητριακών:
Αλεύρι
Ψωμί
Απλά αρτοσκευάσματα π.χ. φρυγανιές, παξιμάδια, κριτσίνια, κράκερ
Σύνθετα αρτοσκευάσματα π.χ. ζύμες, πίτες
Ζυμαρικά π.χ. μακαρόνια, κριθαράκι, χυλοπίτες
Διάφορα προϊόντα δημητριακών π.χ. πλιγούρι,τραχανάς
Δημητριακά πρωινού
Η πατάτα και οι ποικιλίες της'),

('Γάλα και γαλακτοκομικά προϊόντα', 'Το γάλα
Τα γαλακτοκομικά προϊόντα (π.χ. γιαούρτι, τυρί, ξινόγαλο κ.ά.)
ΔΕΝ περιλαμβάνεται το βούτυρο (συγκαταλέγεται στα λίπη και έλαια)'),

('Όσπρια', 'Οι φακές
Τα φασόλια
Τα ρεβίθια
Η φάβα
Τα ξερά κουκιά
Οι ποικιλίες όλων των παραπάνω'),

('Κόκκινο κρέας', 'Μοσχάρι, βοδινό
Χοιρινό
Αρνί, πρόβατο
Κατσίκι, γίδα
Κυνήγι: π.χ. αγριογούρουνο, ελάφι, ζαρκάδι
Όλα τα επεξεργασμένα προϊόντα των παραπάνω'),

('Λευκό κρέας', 'Κοτόπουλο
Γαλοπούλα
Πάπια
Κουνέλι
Κυνήγι: π.χ. φασιανός, ορτύκι, πέρδικα
Όλα τα επεξεργασμένα προϊόντα των παραπάνω'),

('Αυγά', ''),

('Ψάρια και θαλασσινά', '
Τα ψάρια (π.χ. σαρδέλα, μαρίδα, γόπα, γαύρος, αθερίνα, ροφός, συναγρίδα, σφυρίδα, μπακαλιάρος, γαλέος, τόνος, λαβράκι, σαργός, τσιπούρα, λυθρίνι)
Τα θαλασσινά (μαλάκια, οστρακοειδή, οστρακόδερμα) π.χ. καλαμάρι, σουπιά, χταπόδι, γαρίδα, μύδια, στρείδια.'),

('Προστιθέμενα λίπη και έλαια, ελιές και ξηροί καρποί', '
Τα προστιθέμενα λίπη και έλαια:
Ελαιόλαδο
Άλλα έλαια φυτικής προέλευσης (σπορέλαια): ηλιέλαιο, καλαμποκέλαιο, σογιέλαιο, σησαμέλαιο κ.ά.
Μαργαρίνη
Βούτυρο
Οι ελιές
Οι ξηροί καρποί
Καρύδια, αμύγδαλα, φιστίκια, φουντούκια κ.ά.
Ηλιόσποροι, σουσάμι κ.ά.
Προϊόντα επάλειψης που προέρχονται από τα παραπάνω (π.χ., ταχίνι)');

insert into National_Cuisines (name) 
values ('Αζερική κουζίνα'),
 ('Αυστριακή κουζίνα'),
 ('Βιετναμέζικη κουζίνα'),
 ('Γαλλική κουζίνα'),
 ('Γεωργιανή κουζίνα'),
 ('Ελληνική κουζίνα'),
 ('Εσθονική κουζίνα'),
 ('Ιαπωνική κουζίνα'),
 ('Κουζίνα της Ινδίας'),
 ('Ιταλική κουζίνα'),
 ('Κινέζικη κουζίνα'),
 ('Ποντιακή ελληνική κουζίνα'),
 ('Κυπριακή κουζίνα'),
 ('Λευκορωσική κουζίνα'),
 ('Μολδαβική κουζίνα'),
 ('Ουκρανική κουζίνα'),
 ('Πολωνική κουζίνα'),
 ('Ρωσική κουζίνα'),
 ('Σερβική κουζίνα'),
 ('Ταϊλανδέζικη κουζίνα'),
 ('Τουρκική κουζίνα');

 insert into Episodes (episode_year, episode_number) 
 values (2025, 1),
    (2025, 2),
    (2025, 3),
    (2025, 4),
    (2025, 5),
    (2025, 6),
    (2025, 7),
    (2025, 8),
    (2025, 9),
    (2025, 10),
    (2026, 1),
    (2026, 2),
    (2026, 3),
    (2026, 4),
    (2026, 5),
    (2026, 6),
    (2026, 7),
    (2026, 8),
    (2026, 9),
    (2026, 10),
    (2027, 1),
    (2027, 2),
    (2027, 3),
    (2027, 4),
    (2027, 5),
    (2027, 6),
    (2027, 7),
    (2027, 8),
    (2027, 9),
    (2027, 10),
    (2028, 1),
    (2028, 2),
    (2028, 3),
    (2028, 4),
    (2028, 5),
    (2028, 6),
    (2028, 7),
    (2028, 8),
    (2028, 9),
    (2028, 10),
    (2029, 1),
    (2029, 2),
    (2029, 3),
    (2029, 4),
    (2029, 5),
    (2029, 6),
    (2029, 7),
    (2029, 8),
    (2029, 9),
    (2029, 10),
    (2030, 1),
    (2030, 2),
    (2030, 3),
    (2030, 4),
    (2030, 5),
    (2030, 6),
    (2030, 7),
    (2030, 8),
    (2030, 9),
    (2030, 10);

INSERT INTO Cooks (full_name, phone_number, y_of_birth, ys_of_exp, level) 
VALUES ('John Doe', '123-456-7890', 1980, 10, 'αρχιμάγειρας (σεφ)'),
('Jane Smith', '234-567-8901', 1982, 12, 'Β΄ μάγειρας'),
('Alice Johnson', '345-678-9012', 1984, 8, 'Γ΄ μάγειρας'),
('Κατερίνα Αντωνοπούλου', '693-767-0768', 2003, 3, 'αρχιμάγειρας (σεφ)'),
('Charlie Davis', '567-890-1234', 1988, 5, 'Β΄ μάγειρας'),
('Eva Martinez', '678-901-2345', 1990, 7, 'Γ΄ μάγειρας'),
('Frank Harris', '789-012-3456', 1992, 9, 'Β΄ μάγειρας'),
('Grace Lee', '890-123-4567', 1994, 11, 'αρχιμάγειρας (σεφ)'),
('Hannah Clark', '901-234-5678', 1996, 6, 'Β΄ μάγειρας'),
('Ivy Lewis', '012-345-6789', 1998, 4, 'Γ΄ μάγειρας'),
('Jack Walker', '123-456-7890', 1981, 13, 'αρχιμάγειρας (σεφ)'),
('Karen Young', '234-567-8901', 1983, 14, 'Β΄ μάγειρας'),
('Leo Hall', '345-678-9012', 1985, 9, 'Γ΄ μάγειρας'),
('Mia King', '456-789-0123', 1987, 12, 'βοηθός αρχιμάγειρα'),
('Nora Wright', '567-890-1234', 1989, 10, 'Β΄ μάγειρας'),
('Oscar Scott', '678-901-2345', 1991, 7, 'Γ΄ μάγειρας'),
('Pamela Green', '789-012-3456', 1993, 5, 'Β΄ μάγειρας'),
('Quincy Adams', '890-123-4567', 1995, 8, 'Γ΄ μάγειρας'),
('Ruby Baker', '901-234-5678', 1997, 6, 'Β΄ μάγειρας'),
('Steve Mitchell', '012-345-6789', 1999, 3, 'Γ΄ μάγειρας'),
('Δαμιανός Ρούπι', '697-546-3891', 2000, 5, 'αρχιμάγειρας (σεφ)'),
('Umar Nelson', '234-567-8901', 1982, 18, 'Β΄ μάγειρας'),
('Violet Perez', '345-678-9012', 1984, 16, 'Γ΄ μάγειρας'),
('Walter Moore', '456-789-0123', 1986, 14, 'αρχιμάγειρας (σεφ)'),
('Xena Turner', '567-890-1234', 1988, 12, 'Β΄ μάγειρας'),
('Yara White', '678-901-2345', 1990, 10, 'Γ΄ μάγειρας'),
('Zachary Hall', '789-012-3456', 1992, 8, 'Β΄ μάγειρας'),
('Amber Allen', '890-123-4567', 1994, 6, 'Γ΄ μάγειρας'),
('Brian Young', '901-234-5678', 1996, 4, 'Β΄ μάγειρας'),
('Cathy Flores', '012-345-6789', 1998, 2, 'Γ΄ μάγειρας'),
('David Evans', '123-456-7890', 1981, 19, 'βοηθός αρχιμάγειρα'),
('Elaine Brooks', '234-567-8901', 1983, 17, 'Β΄ μάγειρας'),
('Fred Simmons', '345-678-9012', 1985, 15, 'Γ΄ μάγειρας'),
('Gloria Hayes', '456-789-0123', 1987, 13, 'αρχιμάγειρας (σεφ)'),
('Henry Reed', '567-890-1234', 1989, 11, 'Β΄ μάγειρας'),
('Isabella Ramirez', '678-901-2345', 1991, 9, 'Γ΄ μάγειρας'),
('Jason Bell', '789-012-3456', 1993, 7, 'Β΄ μάγειρας'),
('Kelly Russell', '890-123-4567', 1995, 5, 'βοηθός αρχιμάγειρα'),
('Larry Griffin', '901-234-5678', 1997, 3, 'Β΄ μάγειρας'),
('Monica Torres', '012-345-6789', 1999, 1, 'Γ΄ μάγειρας'),
('Nathan Cooper', '123-456-7890', 1982, 18, 'αρχιμάγειρας (σεφ)'),
('Olivia Rivera', '234-567-8901', 1984, 16, 'βοηθός αρχιμάγειρα'),
('Patrick Sanders', '345-678-9012', 1986, 14, 'βοηθός αρχιμάγειρα'),
('Βικ Κορακοβούνη', '698-716-9068', 2001, 5, 'αρχιμάγειρας (σεφ)'),
('Rebecca Long', '567-890-1234', 1990, 10, 'Β΄ μάγειρας'),
('Samuel Foster', '678-901-2345', 1992, 8, 'Γ΄ μάγειρας'),
('Tiffany Ross', '789-012-3456', 1994, 6, 'Β΄ μάγειρας'),
('Ulysses Fisher', '890-123-4567', 1996, 4, 'Γ΄ μάγειρας'),
('Victoria Howard', '901-234-5678', 1998, 2, 'Β΄ μάγειρας'),
('William Ward', '012-345-6789', 1983, 17, 'Γ΄ μάγειρας'),
('Xavier Bryant', '123-456-7890', 1985, 15, 'βοηθός αρχιμάγειρα'),
('Yvonne Alexander', '234-567-8901', 1987, 13, 'Β΄ μάγειρας'),
('Zane Hernandez', '345-678-9012', 1989, 11, 'Γ΄ μάγειρας'),
('Anna Phillips', '456-789-0123', 1991, 9, 'Β΄ μάγειρας'),
('Brandon Campbell', '567-890-1234', 1993, 7, 'Γ΄ μάγειρας'),
('Claire Mitchell', '678-901-2345', 1995, 5, 'βοηθός αρχιμάγειρα'),
('Derek Carter', '789-012-3456', 1997, 3, 'Γ΄ μάγειρας'),
('Elena Peterson', '890-123-4567', 1999, 1, 'Β΄ μάγειρας');

insert into Thematic_Units (name, description) 
values ('Πιάτα για Φοιτητές', 'Εύκολες και γρήγορες συνταγές για φοιτητές'),
('Πιάτα light-Ευ ζην', 'Ελαφριά, υγιεινά και light πιάτα'),
('Άγιος Βαλεντίνος', 'Γιατί ο έρωτας περνάει από το στομάχι'),
('Καλοκαιρινές συνταγές', 'Ελαφριά, δροσερά γεύματα'),
('Χειμωνιάτικες συνταγές', 'Ζεστά χειμωνιάτικα κυρίως πιάτα και σούπες')
('Πάσχα', 'Για το γιορτινό πασχαλινό τραπέζι'),
('Χριστούγεννα', 'Αλμυρές και γλυκές χριστουγεννιάτικες συνταγές'),
('Νηστήσιμα-Vegan', 'Χορτοφαγικά και νηστήσιμα πιάτα'), 
('BBQ', 'Συνταγές για barbeque στην ψησταριά'),
('Παιδικές συνταγές', 'Μενού για τους παιδικούς μας φίλους'),
('Επίσημο δείπνο', 'Συνταγές και ιδέες που θα κερδίσουν τους πιο απαιτητικούς καλεσμένους'),
('Leftovers', 'Φρέσκιες συνταγές για να αξιοποιηθούν τα απομεινάρια και να μην πάει τίποτα χαμένο');

insert into Tags (name) 
values ('brunch'), 
('quick-lunch'), 
('κρύο πιάτο'), 
('finger-food'), 
('ορεκτικά'),
('μαρμελάδες'), 
('ζύμες'), 
('ντιπ & σάλτσες'), 
('φρούτα'), 
('κεφτέδες'), 
('ψωμιά'), 
('σαλάτες'), 
('σάντουιτς');

insert into Meal_Type (name)
values ('Πρωινό'),
('Πρόγευμα'),
('Γεύμα'),
('Απογευματινό'),
('Δείπνο');

 insert into Equipment (name. instructions)
 values ('μπλέντερ', 'Για να ανακατεύουμε τα υλικά σε μια ομαλή συνοχή'),
('επεξεργαστής τροφίμων', 'Για να κόβουμε, κόβουμε σε φέτες, τρίβουμε, αλέθουμε και πολτοποιούμε τα τρόφιμα γρήγορα'),
('σταθερός μίξερ', 'Για να ανακατεύουμε, ζυμώνουμε και χτυπάμε υλικά'),
('χειρός μίξερ', 'Για να ανακατεύουμε και να χτυπάμε υλικά'),
('αργός μαγειρευτής (crockpot)', 'Για να μαγειρεύουμε τα τρόφιμα αργά σε χαμηλή θερμοκρασία για αρκετές ώρες'),
('χύτρα ταχύτητας', 'Για να μαγειρεύουμε τα τρόφιμα γρήγορα υπό υψηλή πίεση'),
('φριτέζα αέρα', 'Για να μαγειρεύουμε τα τρόφιμα χρησιμοποιώντας κυκλοφορία ζεστού αέρα'),
('instant pot', 'Για να λειτουργεί ως πολυλειτουργική συσκευή μαγειρέματος'),
('φούρνος μικροκυμάτων', 'Για να ζεσταίνουμε και να μαγειρεύουμε τα τρόφιμα χρησιμοποιώντας ακτινοβολία μικροκυμάτων'),
('φρυγανιέρα', 'Για να φρυγανίζουμε ψωμί και μπέιγκελ'),
('φούρνος φρυγανιέρας', 'Για να φρυγανίζουμε, ψήνουμε, ψήνουμε στη σχάρα και να ξαναζεσταίνουμε τα τρόφιμα'),
('ηλεκτρική ψησταριά', 'Για να ψήνουμε τα τρόφιμα σε εσωτερικό χώρο'),
('ολλανδικός φούρνος', 'Για να μαγειρεύουμε μια ποικιλία πιάτων, συχνά χρησιμοποιούμενο για βραστά και ψήσιμο'),
('συσκευή ακριβείας sous vide', 'Για να μαγειρεύουμε τα τρόφιμα σε ακριβή θερμοκρασία σε λουτρό νερού'),
('βυθιζόμενο μπλέντερ', 'Για να ανακατεύουμε τα υλικά απευθείας στην κατσαρόλα ή το δοχείο'),
('ηλεκτρικός βραστήρας', 'Για να βράζουμε νερό γρήγορα'),
('μαγειρευτής ρυζιού', 'Για να μαγειρεύουμε ρύζι αυτόματα'),
('βαφλιέρα', 'Για να μαγειρεύουμε βάφλες'),
('μηχανή ποπκόρν', 'Για να φτιάχνουμε ποπκόρν'),
('αποχυμωτής', 'Για να εξάγουμε χυμό από φρούτα και λαχανικά');

insert into Ingredients (name, calories_per_100, group_id)
values ('αλεύρι', 364, 3),
('γιαούρτι', 61, 4),
('ντομάτα', 18, 1),
('πορτοκάλι', 43, 2),
('ρύζι', 130, 3),
('γάλα', 61, 4),
('καρότο', 41, 1),
('μήλο', 52, 2),
('μακαρόνια', 131, 3),
('τυρί', 356, 4),
('μπρόκολο', 34, 1),
('σταφίδες', 299, 2),
('πατάτα', 77, 3),
('φέτα', 264, 4),
('κολοκύθι', 17, 1),
('μπανάνα', 89, 2),
('κριθαράκι', 123, 3),
('ξινόγαλο', 64, 4),
('λαχανίδα', 15, 1),
('ροδάκινο', 39, 2),
('φρυγανιές', 242, 3),
('φακές', 341, 5),
('κρεμμύδι', 40, 1),
('βερίκοκο', 48, 2),
('κριτσίνια', 425, 3),
('φασόλια', 341, 5),
('σπανάκι', 23, 1),
('χυμός πορτοκαλιού', 45, 2),
('πλιγούρι', 123, 3),
('ρεβίθια', 164, 5),
('αγγούρι', 15, 1),
('δάφνη', 313, 2),
('τραχανάς', 322, 3),
('φάβα', 88, 5),
('πιπεριά', 20, 1),
('χυμός μήλου', 48, 2),
('ψωμί', 250, 3),
('κουκιά', 145, 5),
('παντζάρι', 43, 1),
('αχλάδι', 42, 2),
('ζύμη', 299, 3),
('μοσχάρι', 250, 6),
('κολοκύθα', 17, 1),
('χοιρινό', 280, 6),
('παξιμάδι', 360, 3),
('αρνί', 282, 6),
('κοτόπουλο', 219, 7),
('φασιανός', 158, 7),
('γάλα αμυγδάλου', 13, 4),
('καλαμπόκι', 86, 1),
('γαλοπούλα', 109, 7),
('πάπια', 337, 7),
('φρυγανιές', 242, 3),
('κουνέλι', 173, 7),
('ελαιόλαδο', 884, 8),
('καρύδια', 618, 8),
('φιστίκια', 557, 8),
('αρακάς', 116, 1),
('κολοκυθάκια', 16, 1),
('χαρουπόμελο', 290, 2),
('σογιέλαιο', 884, 8),
('μαργαρίνη', 717, 8),
('ελιές', 115, 8),
('αμύγδαλα', 575, 8),
('σησαμέλαιο', 884, 8),
('παπαρουνόσπορος', 570, 8),
('βούτυρο', 717, 8),
('ταχίνι', 593, 8),
('ηλιόσποροι', 584, 8),
('φουντούκια', 657, 8),
('κάρδαμο', 330, 1),
('γαλέτα', 411, 3),
('σαρδέλα', 208, 9),
('γαύρος', 151, 9),
('αθερίνα', 130, 9),
('καλαμάρι', 100, 9),
('σουπιά', 79, 9),
('χταπόδι', 57, 9),
('γαρίδα', 71, 9),
('μύδια', 60, 9),
('στρείδια', 90, 9),
('αγκινάρες', 47, 1),
('καρκινάκια', 90, 9),
('καβούρι', 83, 9),
('λαβράκι', 97, 9),
('τσιπούρα', 115, 9),
('λυθρίνι', 115, 9),
('μαρίδα', 86, 9),
('συναγρίδα', 139, 9),
('σφυρίδα', 95, 9),
('μπακαλιάρος', 82, 9);